import gtts as gt
import os

TamilText = "இந்திய அரசியலமைப்புச் சட்டத்தின் 226வது பிரிவின் கீழ் தாக்கல் செய்யப்பட்ட ரிட் மனு," \
            " முதல் பிரதிவாதியை வழிநடத்தும், மாண்டமஸ் உத்தரவை பிறப்பிக்க இந்த நீதிமன்றத்தை வேண்டிக்கொள்கிறேன்" \
            " வேளலூர் நாடு ஸ்ரீ எல்லைகாத்தம்மன் கோவிலை மேம்படுத்தி அறிவிக்க வேண்டும்" \
            " கோவில்பட்டி-குறிச்சிப்பட்டி, மேலூர் தாலுக்கா, மதுரை மாவட்டம் மற்றும் அதன் உபகோயில்கள் ஸ்ரீ" \
            " வல்லடிகாரகோவில், அம்பலகாரன்பட்டி, மேலூர் தாலுக்கா, மதுரை, ஸ்ரீ கருங்கல்" \
            " மந்த கருப்பசாமி கோவில், வேளலூர் மற்றும் செம்பூர் அய்யனார், கடம்பூர்" \
            " அய்யனார், பெரம்பூர் அய்யனார் கோயில்கள் வெள்ளைகம்மை, வேளலூர் நாடு" \
            " பட்டியல்-1 கோவில்/பட்டியலிடப்படாத கோவில் முதல் பட்டியல்-3/பட்டியலிடப்பட்ட கோவில் வரை வருடாந்திர அடிப்படையில்" \
            " தமிழ்நாடு இந்து சமயப் பிரிவு 46ன் படி கோவிலின் வருமானம்" \
            " மற்றும் அறக்கட்டளைச் சட்டம் மற்றும் நிர்வாக அதிகாரியை நிர்வகிப்பதற்கு நியமிக்கவும்" \
            " தமிழ்நாடு இந்து சமயத்தின் 45வது பிரிவின்படி கோவில் மற்றும்" \
            " அறக்கட்டளைச் சட்டம்." \
            "தற்போதைய ரிட் மனு, பரந்த நிவாரணத்திற்காக தாக்கல் செய்யப்பட்டுள்ள போதிலும்" \
            " ஸ்ரீ கோவில்பட்டி-குறிச்சிப்பட்டி, மேலூரில் உள்ள வேளலூர் நாட்டு எல்லைகாத்தம்மன் கோவில்" \
            " தாலுகா, மதுரை மாவட்டம் மற்றும் அதன் உபகோயில்கள், ஸ்ரீ வல்லடிகாரகோவில், அம்பலகாரன்பட்டி, மேலூர் தாலுக்கா, மதுரை, ஸ்ரீ கருங்கல் மந்த கருப்பசாமி" \
            " கோவில், வேளலூர் மற்றும் செம்பூர் அய்யனார், கடம்பூர் அய்யனார், பெரம்பூர் அய்யனார்" \
            " பட்டியல்-1 கோவில்/பட்டியலிடப்படாத கோவில்களில் இருந்து வெள்ளைகம்மை, வேளலூர் நாடு கோவில்கள்" \
            " பட்டியல்-3/பட்டியலிடப்பட்ட கோவில் மற்றும் நிர்வாக அதிகாரியை நிர்வகித்தல்" \
            " மேற்குறிப்பிட்ட கோவில்களில், இந்த ரிட் மனுவை, இயக்குனரின் மூலம் தீர்த்து வைக்க முனைகிறேன்" \
            " 3வது பிரதிவாதி/ இணை ஆணையர், மதுரை, பரிசீலித்து நிறைவேற்ற வேண்டும்" \
            " 28.05.2019 தேதியிட்ட மனுதாரரின் பிரதிநிதித்துவத்தின் மீது உரிய உத்தரவுகள்" \
            " தகுதிகள் மற்றும் சட்டத்தின்படி.  கடந்து செல்வதற்கு முன் அதைக் குறிப்பிடத் தேவையில்லை" \
            " அத்தகைய உத்தரவுகள், இதில் உள்ள தனிப்பட்ட பிரதிவாதிகள் மற்றும் பிற நபர்கள்" \
            " அத்தகைய உத்தரவுகளால் பாதிக்கப்பட வாய்ப்பு உள்ளது, மேலும் கேட்கப்படும்.  இந்த பயிற்சி இருக்கலாம்" \
            " தேதியிலிருந்து 9 வாரங்களுக்குள் 3வது பிரதிவாதியால் மேற்கொள்ளப்படுகிறது" \
            " இந்த உத்தரவின் நகலின் ரசீது." \
            " 2. மேற்கூறியவற்றின் அடிப்படையில் ரிட் மனு தள்ளுபடி செய்யப்படுகிறது" \
            " கவனிப்பு.  செலவுகள் இல்லை."
tts = gt.gTTS(text=TamilText, lang='ta')
tts.save("Tamil-Audio.mp3")
os.system("Tamil-Audio.mp3")